# Напишите программу, которая по данному числу n от 1 до 9 выводит на экран
# n флагов. Изображение одного флага имеет размер 4×4 символов,
# между двумя соседними флагами также имеется пустой (из пробелов) столбец.
# Разрешается вывести пустой столбец после последнего флага. Внутри каждого
# флага должен быть записан его номер — число от 1 до n.

#Вариант 1 = цикл в цикле
namber = int(input('Сколько флагов вы хотите увидеть? (рекомендовано до 9)= '))

for i in range(namber, namber + 1):
    print('+___ '*namber)
    for i in range(namber):
        print('|', i+1 ,' / ',sep = '', end = '')
    print()
    print('|__\\ '*namber,'|    '*namber,sep="\n")

# Вариант 2 = циклируется только вторая строка
namber = int(input('Сколько флагов вы хотите увидеть? (рекомендовано до 9) = '))
print('+___ '*namber)
for i in range(namber):
    print('|', i+1, ' /', sep='', end=' ')
print()
print('|__\\ '*namber)
print('|    '*namber)

input('Нажмите Enter, что бы выйти...')
